Repository: Skiroll5/wadeea
Catalog: mobile/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Wadeea
ar: وديعة

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Register
ar: انشاء حساب

# waitActivation
source: Wait for admin activation
ar: انتظر تفعيل الأدمن

source: Classes
ar: الفصول

source: Students
ar: الطلاب

source: Attendance
ar: الغياب

# statisticsDashboard
source: Statistics
ar: الإحصائيات

source: At Risk Students
ar: محتاجين افتقاد

source: At Risk Threshold
ar: تنبيه الافتقاد

# thresholdCaption
source: Flag student after {threshold} consecutive absences
ar: تنبيه بعد {threshold} غيابات متتالية

# attendanceTrends
source: Attendance Trends (Last 12 Weeks)
ar: مؤشر الحضور (آخر 12 أسبوع)

# absentTimes
source: Absent {count} times
ar: غائب {count} مرات

# noAtRiskStudents
source: Great job! No students are currently at risk.
ar: نشكر ربنا! مفيش حد محتاج افتقاد حالياً.

source: Your Classes
ar: فصولك

source: Your Class
ar: فصلك

# selectClassToManage
source: Select a class to manage students and attendance
ar: اختر فصلاً لإدارة الطلاب والغياب

source: No classes yet
ar: لا توجد فصول بعد

source: No class assigned
ar: لم يتم تعيين فصل

source: Waiting for class assignment
ar: بانتظار تعيين الفصل

source: Create Class
ar: إضافة فصل

source: Add Class
ar: إضافة فصل

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Rename
ar: إعادة تسمية

source: Hi
ar: مرحباً

source: User
ar: مستخدم

source: Search
ar: بحث

source: Call
ar: اتصال

source: Phone
ar: الهاتف

source: No Phone
ar: لا يوجد هاتف

source: Phone number copied
ar: تم نسخ رقم الهاتف

source: Address
ar: العنوان

source: Birthdate
ar: تاريخ الميلاد

# visitationNotes
source: Notes
ar: الملاحظات

# noNotes
source: No notes yet.
ar: لا توجد ملاحظات بعد.

source: Add Note
ar: إضافة ملاحظة

source: Age
ar: العمر

# yearsOld
source: {count} years old
ar: {count} سنة

source: Next Birthday
ar: عيد الميلاد القادم

# birthdayCountdown
source: In {months} months, {days} days
ar: خلال {months} شهر و {days} يوم

# todayIsBirthday
source: Today is their birthday! ðŸŽ‰
ar: عيد ميلاده النهاردة! 🎉

# addNoteCaption
source: Add a note for this student
ar: أضف ملاحظة لهذا الطالب

# whatHappened
source: Write note content...
ar: اكتب محتوى الملاحظة...

source: Student Details
ar: بيانات الطالب

source: Settings
ar: الإعدادات

source: Logout
ar: تسجيل الخروج

source: Language
ar: اللغة

source: Theme
ar: المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: النظام

source: Version
ar: الإصدار

source: Admin
ar: أدمن

source: Servant
ar: خادم

source: Student not found
ar: الطالب غير موجود

source: Details
ar: التفاصيل

# noAddress
source: No address provided
ar: لا يوجد عنوان

source: Not set
ar: غير محدد

source: Edit Student
ar: تعديل الطالب

source: Name
ar: الاسم

source: Date of Birth
ar: تاريخ الميلاد

# deleteStudentQuestion
source: Delete Student?
ar: حذف الطالب؟

# deleteStudentWarning
source: This student and all their records will be permanently removed. This action cannot be undone.
ar: سيتم حذف هذا الطالب وجميع سجلاته بشكل دائم. لا يمكن التراجع عن هذا الإجراء.

source: Select Theme
ar: اختر المظهر

source: Select Language
ar: اختر اللغة

source: Add New Student
ar: إضافة طالب جديد

# addStudentCaption
source: Add a student to this class
ar: أضف طالب لهذا الفصل

source: Student Name
ar: اسم الطالب

source: Phone Number (optional)
ar: رقم الهاتف (اختياري)

source: Address (optional)
ar: العنوان (اختياري)

# pleaseEnterName
source: Please enter a name
ar: يرجى إدخال الاسم

# addStudentAction
source: Add Student
ar: إضافة الطالب

source: Create New Class
ar: إنشاء فصل جديد

# addClassCaption
source: Add a new class to manage students
ar: أضف فصل جديد لإدارة الطلاب

source: Class Name
ar: اسم الفصل

# classNameHint
source: e.g. Sunday School - Grade 3
ar: مثال: ثالثة إبتدائي أولاد

source: Grade (Optional)
ar: السنة الدراسية (اختياري)

# gradeHint
source: e.g. Grade 3
ar: مثال: الصف الثالث

source: Create
ar: إنشاء

source: Upcoming Birthdays
ar: أعياد الميلاد القادمة

source: Today!
ar: النهاردة!

source: Tomorrow
ar: بكره

# daysLeft
source: {count} days left
ar: باقي {count} يوم

# markAbsentPast
source: Mark absent for past sessions
ar: تسجيل غياب للحصص السابقة

# markAbsentPastCaption
source: Student will be recorded as ABSENT for all previous sessions.
ar: سيتم تسجيل الطالب 'غائب' في جميع الحصص السابقة.

# sessionTime
source: Time
ar: الوقت

source: Attendance Sessions
ar: جلسات الحضور

source: No attendance sessions yet
ar: لا توجد جلسات حضور بعد

source: Tap below to take attendance
ar: اضغط بالأسفل لتسجيل الحضور

source: Add students first
ar: أضف الطلاب أولاً

source: Add students first to take attendance
ar: أضف الطلاب أولاً لتسجيل الحضور

source: No upcoming birthdays
ar: لا توجد أعياد ميلاد قادمة

source: Attendance History
ar: سجل الحضور

source: Present
ar: حاضر

source: Absent
ar: غائب

source: Excused
ar: بعذر

source: Late
ar: متأخر

source: Data Management
ar: إدارة البيانات

# resetDataCaption
source: If you manually reset the backend database, use this to clear local data.
ar: استخدم هذا الخيار فقط إذا تم إعادة تعيين قاعدة البيانات. سيتم مسح البيانات المحلية.

source: Reset Sync & Data
ar: إعادة تعيين المزامنة والبيانات

source: Confirm Reset
ar: تأكيد إعادة التعيين

# resetWarning
source: This will delete all local attendance data and force a full re-sync from the server. Use only if backend was cleared.
ar: سيؤدي هذا لعملية مسح كاملة للبيانات المحلية وإعادة المزامنة.

source: Attendance Details
ar: تفاصيل الغياب

source: Attendance Rate
ar: نسبة الحضور

# showMore
source: Read More
ar: قراءة المزيد

source: Show Less
ar: إخفاء

# deleteWarning
source: Are you sure you want to delete this?
ar: هل أنت متأكد من الحذف؟

source: No attendance records
ar: لا توجد سجلات غياب

source: Sort by
ar: رتب حسب

# attendancePercentage
source: Attendance
ar: نسبة الحضور

# sortAscending
source: Ascending
ar: تصاعدي

# sortDescending
source: Descending
ar: تنازلي

# sortByName
source: Name
ar: الاسم

# sortByStatus
source: Status
ar: الحالة

# absencesTotal
source: {count} Absences (Total)
ar: {count} غياب (كلي)

# consecutive
source: {count} Consecutive
ar: {count} متتالية

source: WhatsApp Template
ar: صيغة رسالة الواتساب

# whatsappTemplateDesc
source: Customize the default message sent to students
ar: تخصيص الرسالة الافتراضية المرسلة للطلاب

source: New Arrivals
ar: طلاب جدد

# tapToAddToSession
source: Tap to add to this session
ar: اضغط لإضافتهم لهذه الجلسة

# notInSession
source: Not in this session
ar: غير مسجل في هذه الجلسة

# whatsappCustomize
source: Customize Message
ar: تخصيص الرسالة

# whatsappButton
source: WhatsApp
ar: واتساب

# deleteSessionConfirmTitle
source: Delete Session?
ar: حذف الحصة؟

# deleteSessionConfirmMessage
source: Are you sure you want to delete this session? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه الحصة؟ لا يمكن التراجع عن هذا الإجراء.

# typeMessageHint
source: Type your message...
ar: اكتب رسالتك...

source: Message saved
ar: تم حفظ الرسالة

source: View All
ar: عرض الكل

source: Take Attendance
ar: تسجيل الغياب

source: New Attendance
ar: تسجيل حضور جديد

source: Change Date & Time
ar: تغيير التاريخ والوقت

# noStudentsInClass
source: No students in this class
ar: لا يوجد مخدومين في هذا الفصل

# attendancePresentCount
source: {present} of {total} present
ar: {present} من {total} حاضر

# tapToMark
source: Tap students to mark attendance
ar: اضغط على المخدوم لتسجيل حضوره

# markAll
source: All
ar: الكل

# clearAll
source: Clear
ar: مسح

source: Session Note
ar: ملاحظة الحصة

# sessionNoteHint
source: Add session note...
ar: إضافة ملاحظة للحصة...

source: Saving...
ar: جار الحفظ...

source: Save Attendance
ar: حفظ الحضور

source: Attendance saved!
ar: تم حفظ الحضور!

source: Default Attendance Note
ar: ملاحظة الحصة الافتراضية

# defaultAttendanceNoteDesc
source: Set the default note for new sessions
ar: تعيين الملاحظة الافتراضية للحصص الجديدة

source: Edit Session Note
ar: تعديل ملاحظة الحصة

# defaultNoteHint
source: Enter default note...
ar: أدخل الملاحظة الافتراضية...

source: Status
ar: الحالة

source: Unknown
ar: مجهول

source: Unknown class
ar: فصل غير معروف

source: Discard Changes?
ar: تجاهل التغييرات؟

# discardChangesMessage
source: You have unsaved changes. Are you sure you want to discard them?
ar: لديك تغييرات غير محفوظة. هل أنت متأكد أنك تريد تجاهل هذه التغييرات؟

# discard
source: Discard Changes
ar: تجاهل التغييرات

source: Last Session
ar: آخر حصة

# consecutiveAbsences
source: Consecutive
ar: متتالي

# successAddStudent
source: Student added successfully
ar: تم إضافة الطالب بنجاح

# errorAddStudent
source: Error adding student: {error}
ar: خطأ في إضافة الطالب: {error}

# errorGeneric
source: Error: {error}
ar: خطأ: {error}

# errorWhatsApp
source: Could not launch WhatsApp
ar: تعذر تشغيل واتساب

# errorSave
source: Error saving: {error}
ar: خطأ في الحفظ: {error}

# successSaveTemplate
source: Template saved successfully
ar: تم حفظ الرسالة الإفتراضية بنجاح

# errorSaveTemplate
source: Failed to save template
ar: فشل حفظ الرسالة الإفتراضية

# successResetData
source: Success: Local data reset and re-synced.
ar: تم إعادة تعيين البيانات المحلية والمزامنة بنجاح.

# errorResetData
source: Error resetting data: {error}
ar: خطأ في إعادة تعيين البيانات: {error}

source: Notification Settings
ar: إعدادات الإشعارات

source: Inactive after (days)
ar: غير نشط بعد (أيام)

# daysUnit
source: {count} days
ar: {count} يوم

source: Birthday alert time
ar: وقت تنبيه عيد الميلاد

# addNewClassTitle
source: Add New Class
ar: إضافة فصل جديد

source: Add
ar: إضافة

source: Manage Classes
ar: إدارة الفصول

# noClassesFoundAdd
source: No classes found. Add one!
ar: لا توجد فصول. أضف واحدًا!

source: No class selected
ar: لم يتم اختيار فصل

source: User Management
ar: إدارة المستخدمين

source: No pending users
ar: لا يوجد مستخدمين قيد الانتظار

source: Activate
ar: تفعيل

source: No users found
ar: لا يوجد مستخدمين

# errorUpdateUser
source: Failed to update user
ar: فشل تحديث بيانات المستخدم

source: Class Management
ar: إدارة الفصول

source: No classes found
ar: لا توجد فصول

# managersForClass
source: Managers: {className}
ar: مديرين {className}

source: Remove Manager
ar: إزالة المدير

source: Remove
ar: إزالة

source: No eligible users
ar: لا يوجد مستخدمين مؤهلين

# allUsersAreManagers
source: All eligible users are already managers
ar: جميع المستخدمين المؤهلين هم مديرون بالفعل

source: Access Denied
ar: تم رفض الوصول

source: Not enough data
ar: لا توجد بيانات كافية

# genericError
source: Error
ar: خطأ

source: Available placeholders:
ar: المتغيرات المتاحة:

source: Preview
ar: معاينة

source: (Empty message)
ar: (رسالة فارغة)

# whatsappMessageHint
source: Hello {firstname}, how are you?
ar: إزيك يا [firstname]

# whatsappDefaultTemplate
source: Hi %firstname%,
ar: إزيك يا [firstname]

# notificationSettingsDesc
source: Manage push notifications
ar: إدارة الإشعارات

# notesNotification
source: Notes
ar: الملاحظات

# notesNotificationDesc
source: Get notified when a note is added
ar: تلقي إشعار عند إضافة ملاحظة

# attendanceNotification
source: Attendance
ar: الغياب

# attendanceNotificationDesc
source: Get notified when attendance is recorded
ar: تلقي إشعار عند تسجيل الحضور

# birthdayNotification
source: Birthday Reminders
ar: أعياد الميلاد

# birthdayNotificationDesc
source: Get reminders for student birthdays
ar: تلقي تذكيرات بأعياد ميلاد الطلاب

# inactiveNotification
source: Inactive Students
ar: الطلاب غير النشطين

# inactiveNotificationDesc
source: Alert when a student becomes inactive
ar: تنبيه عند عدم نشاط طالب

# newUserNotification
source: New Registrations
ar: تسجيلات جديدة

# newUserNotificationDesc
source: Notify when a new user registers
ar: تلقي إشعار عند تسجيل مستخدم جديد

# inactiveThresholdDesc
source: Threshold to consider a student inactive
ar: الحد الأدنى لاعتبار الطالب غير نشط

# birthdayReminderDays
source: Days before birthday
ar: أيام قبل عيد الميلاد

# birthdayReminderDaysDesc
source: How many days before to send reminder
ar: كم يوم قبل عيد الميلاد لإرسال التذكير

source: Same day
ar: نفس اليوم

# daysBefore
source: {count} days before
ar: قبل {count} يوم

source: Tap to change time
ar: اضغط لتغيير الوقت

# morningTime
source: Morning (8:00 AM)
ar: صباحاً (8:00 ص)

# eveningTime
source: Evening before (8:00 PM)
ar: مساءً (8:00 م)

source: Pending Activation
ar: بانتظار التفعيل

source: All Users
ar: كل المستخدمين

source: User activated!
ar: تم تفعيل المستخدم!

# userActivationFailed
source: Failed to activate
ar: فشل التفعيل

source: Current Managers
ar: المديرون الحاليون

source: No managers assigned
ar: لا يوجد مديرين معينين

# removeManagerTitle
source: Remove Manager
ar: إزالة المدير

# removeManagerConfirm
source: Remove {name} as manager?
ar: هل تريد إزالة {name} من الإدارة؟

source: Add Manager
ar: إضافة مدير

# managerAdded
source: {name} added as manager
ar: تم إضافة {name} كمدير

# managerAddFailed
source: Failed to add manager
ar: فشل إضافة المدير

# noAdminPrivileges
source: You do not have admin privileges.
ar: ليس لديك صلاحيات المسؤول.

source: Admin Panel
ar: لوحة التحكم

# adminPanelDesc
source: Manage users, classes & data
ar: إدارة المستخدمين والفصول والبيانات

source: Management
ar: الإدارة

# userManagementDesc
source: Activate, enable/disable users
ar: تفعيل، تمكين/تعطيل المستخدمين

# classManagementDesc
source: Manage classes and managers
ar: إدارة الفصول والمديرين

source: Statistics
ar: الإحصائيات

source: Appearance
ar: المظهر

source: Preferences
ar: التفضيلات

source: About
ar: حول

source: Danger Zone
ar: مزامنة مع السيرفر

# resetAllData
source: Synchronize with the server
ar: إعادة تعيين جميع البيانات

# resetAllDataDesc
source: Sync all sessions and records
ar: مزامنة جميع الجلسات والسجلات

# resetDataTitle
source: Sync Data?
ar: مزامنة البيانات؟

# resetDataConfirm
source: Are you sure you want to synchronize all data?
ar: هل أنت متأكد من أنك تريد مزامنة جميع البيانات؟

source: Reset
ar: إعادة تعيين

# classCreated
source: Class created successfully
ar: تم إنشاء الفصل بنجاح

# classCreationError
source: Failed to create class
ar: فشل إنشاء الفصل

source: Enter class name
ar: أدخل اسم الفصل

source: Enter grade
ar: أدخل الصف

# accountPendingActivation
source: Your account is awaiting admin activation
ar: حسابك في انتظار تفعيل المسؤول

# accountDenied
source: Your activation request was denied by the administrator
ar: تم رفض طلب التفعيل من قبل المسؤول

# accountDeniedDesc
source: Your activation request was denied. If you believe this was a mistake, please contact the administrator for assistance.
ar: تم رفض طلب التفعيل الخاص بك. إذا كنت تعتقد أن هذا خطأ، يرجى التواصل مع المسؤول للمساعدة.

# accountDisabled
source: Your account has been disabled by the administrator
ar: تم تعطيل حسابك من قبل المسؤول

# invalidCredentials
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: Registration Successful!
ar: تم التسجيل بنجاح!

# registrationSuccessfulDesc
source: Please wait for the administrator to activate your account
ar: يرجى انتظار المسؤول لتفعيل حسابك

# emailAlreadyExists
source: An account with this email already exists
ar: يوجد حساب مرتبط بهذا البريد الإلكتروني

# createAccountToStart
source: Create your account to get started
ar: أنشئ حسابك للبدء

# contactAdminForActivation
source: Please contact the administrator to activate your account
ar: يرجى التواصل مع المسؤول لتفعيل حسابك

# abortActivation
source: Deny Activation
ar: رفض التفعيل

# abortActivationConfirm
source: Are you sure you want to deny this user's activation request?
ar: هل أنت متأكد أنك تريد رفض طلب تفعيل هذا المستخدم؟

# userActivationAborted
source: User activation denied
ar: تم رفض تفعيل المستخدم

source: Enable User
ar: تفعيل المستخدم

source: Disable User
ar: تعطيل المستخدم

# enableUserConfirm
source: Enable this user's access to the app?
ar: هل تريد تمكين وصول هذا المستخدم للتطبيق؟

# disableUserConfirm
source: Disable this user's access? They will be logged out immediately.
ar: هل تريد تعطيل وصول هذا المستخدم؟ سيتم تسجيل خروجه فوراً.

source: User enabled!
ar: تم تفعيل المستخدم!

source: User disabled.
ar: تم تعطيل المستخدم.

source: Delete User
ar: حذف المستخدم

# deleteUserConfirm
source: Are you sure you want to delete this user? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا المستخدم؟ لا يمكن التراجع عن هذا الإجراء.

# userDeleted
source: User deleted successfully
ar: تم حذف المستخدم بنجاح

# abortedActivations
source: Denied Activations
ar: طلبات التفعيل المرفوضة

# noAbortedUsers
source: No denied activation requests
ar: لا توجد طلبات تفعيل مرفوضة

# viewDeniedUsersDesc
source: View and manage users whose activation was denied
ar: عرض وإدارة المستخدمين الذين تم رفض تفعيلهم

source: Reactivate
ar: إعادة التفعيل

# reactivateConfirmation
source: Are you sure you want to reactivate {name}? They will be able to log in again.
ar: هل أنت متأكد من إعادة تفعيل {name}؟ سيتمكن من تسجيل الدخول مرة أخرى.

source: Deny
ar: رفض

# classManagers
source: Managers
ar: المديرون

source: Disabled
ar: معطّل

source: Active
ar: نشط

source: Pending
ar: قيد الانتظار

source: Events
ar: الأحداث

source: Alerts
ar: التنبيهات

source: Configuration
ar: الإعدادات

# systemThemeDesc
source: Follow device settings
ar: اتباع إعدادات الجهاز

# lightThemeDesc
source: Bright appearance
ar: المظهر الفاتح

# darkThemeDesc
source: Dark appearance
ar: المظهر الداكن

# englishLanguageDesc
source: English language
ar: اللغة الإنجليزية

# arabicLanguageDesc
source: Arabic language
ar: اللغة العربية

source: Activity notifications
ar: إشعارات النشاط

source: Important warnings
ar: تحذيرات مهمة

source: Customize behavior
ar: تخصيص السلوك

source: Manage
ar: إدارة

source: Good
ar: جيد

source: Average
ar: متوسط

source: Poor
ar: ضعيف

# manageClassManagers
source: Manage Managers
ar: إدارة المديرين

# classManagersDescription
source: Managers for {className}
ar: مديرو {className}

source: Enabled
ar: مُفعّل

# accountPendingActivationDesc
source: Your account has been created successfully but is waiting for administrator approval. You will be notified once your account is active.
ar: تم إنشاء حسابك بنجاح ولكنه في انتظار موافقة المسؤول. سيتم إشعارك عند تفعيل حسابك.

# removingManager
source: Removing {name}...
ar: جاري إزالة {name}...

# addingManager
source: Adding {name}...
ar: جاري إضافة {name}...

source: Available Users
ar: المستخدمون المتاحون

# removeManagerConfirmation
source: Are you sure you want to remove {name} as a manager from this class?
ar: هل أنت متأكد من إزالة {name} كمدير من هذا الصف؟

# addManagerConfirmation
source: Are you sure you want to add {name} as a manager for this class?
ar: هل أنت متأكد من إضافة {name} كمدير لهذا الصف؟

# serverConnectionError
source: Cannot connect to server. Please check your internet connection.
ar: لا يمكن الاتصال بالسيرفر. يرجى التحقق من اتصالك بالإنترنت.

source: Try Again
ar: حاول مجدداً

source: Loading data...
ar: جارٍ تحميل البيانات...

source: Cannot Connect
ar: لا يمكن الاتصال

source: Something Went Wrong
ar: حدث خطأ ما

source: Auto-retrying...
ar: جارٍ إعادة المحاولة تلقائياً...

# willAutoRetry
source: Will auto-retry when connected
ar: ستتم إعادة المحاولة عند الاتصال

# serverError
source: Server error. Please try again later.
ar: خطأ في السيرفر. يرجى المحاولة لاحقاً.

# unauthorized
source: Unauthorized. Please log in again.
ar: غير مصرح. يرجى تسجيل الدخول مرة أخرى.

# actionFailedCheckConnection
source: Action failed. Check your internet connection.
ar: فشل الإجراء. تحقق من اتصالك بالإنترنت.

source: Manager assigned!
ar: تم تعيين المدير!

source: Manager removed.
ar: تمت إزالة المدير.

source: Loading Admin Panel...
ar: جارٍ تحميل لوحة الإدارة...

source: Loading class managers...
ar: جارٍ تحميل مديري الفصول...

# enableUserConfirmation
source: Are you sure you want to enable "{name}"?
ar: هل أنت متأكد من تفعيل "{name}"؟

# disableUserConfirmation
source: Are you sure you want to disable "{name}"?
ar: هل أنت متأكد من تعطيل "{name}"؟

source: Enable
ar: تفعيل

source: Disable
ar: تعطيل

source: No students yet
ar: لا يوجد طلاب بعد

# tapAddStudentsAbove
source: Tap the + button above to add students
ar: اضغط على زر + أعلاه لإضافة طلاب
